app/controllers/urls_controller.rb

INSERT INTO "urls" ("created_at", "updated_at", "url") VALUES (?, ?, ?)  [["created_at", Tue, 31 Jul 2012 05:43:39 UTC +00:00], ["updated_at", Tue, 31 Jul 2012 05:43:39 UTC +00:00], ["url", nil]]
---
  def create
  	@shortened_url = Url.new
  	@shortened_url.url = params[:url][:url]
  	if @shortened_url.save

SELECT "urls".* FROM "urls" WHERE "urls"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
  	@shortened_url = Url.find(params[:id])